/**
* \file    addressVarEeeprom.h
* \brief   Адреса переменных и констант, хранящихся в EEPROM.
* 
* \version 1.0.1
* \date    18-07-2016
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef addressVarEeeprom_h
#define addressVarEeeprom_h

//*****************************************************************************
// Глобальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
#define ADDRESS_EEPROM_PROTECTION_STATE_CODE_0 0x000C       ///< Адрес 0-ой ячейки EEPROM с кодом ЗС. 
#define ADDRESS_EEPROM_PROTECTION_STATE_CODE_1 0x000E       ///< Адрес 1-ой ячейки EEPROM с кодом ЗС. 
#define ADDRESS_EEPROM_PROTECTION_STATE_CODE_2 0x0FF0       ///< Адрес 2-ой ячейки EEPROM с кодом ЗС. 
#define ADDRESS_EEPROM_PROTECTION_STATE_CODE_3 0x0FF2       ///< Адрес 3-ей ячейки EEPROM с кодом ЗС. 
#define ADDRESS_EEPROM_PROTECTION_STATE_CODE_4 0x0010       ///< Адрес 4-ой ячейки EEPROM с кодом ЗС. 
#define ADDRESS_EEPROM_ID_DEVICE               0x0000       ///< Адрес ячейки EEPROM с идентификатором прибора. 

//*****************************************************************************
/// \brief Адрес ячейки EEPROM с номером версии ПО xx.yy.zz. Первая часть(xx). 
/// 
#define ADDRESS_EEPROM_VERSION_SOFTWARE_1    0x0002

//*****************************************************************************
/// \brief Адрес ячейки EEPROM с номером версии ПО xx.yy.zz. Вторая часть(yy).
/// 
#define ADDRESS_EEPROM_VERSION_SOFTWARE_2    0x0004

//*****************************************************************************
/// \brief Адрес ячейки EEPROM с номером версии ПО xx.yy.zz. Третья часть(zz).
/// 
#define ADDRESS_EEPROM_VERSION_SOFTWARE_3    0x0006

//*****************************************************************************
#define ADDRESS_EEPROM_CONTROL_TOTAL_FLASH_1 0x0008         ///< Адрес 1-ой ячейки EEPROM с контрольной суммой прошивки.

//*****************************************************************************
//0x0212
#define ADDRESS_EEPROM_CONTROL_TOTAL_FLASH_2 0x0FF8         ///< Адрес 2-ой ячейки EEPROM с контрольной суммой прошивки.

//*****************************************************************************
//0x0322
#define ADDRESS_EEPROM_CONTROL_TOTAL_FLASH_3 0x0FFA         ///< Адрес 3-ей ячейки EEPROM с контрольной суммой прошивки.

//*****************************************************************************
// Объявление глобальных типизированных констант
//*****************************************************************************

//*****************************************************************************
/// \brief Адрес массива EEPROM с уточняющей информацией для ЗС. 
/// 
static const FLASH uint16_t   ADDRESS_EEPROM_PROTECTION_STATE_ADD_CODE = 0x0012;

//*****************************************************************************
/// \brief Адрес ячейки EEPROM с текущим временем работы, с. 
/// 
static const FLASH uint16_t   ADDRESS_EEPROM_TIME_SEC                  = 0x0020;

//*****************************************************************************
/// \briefАдрес ячейки EEPROM с текущим временем работы, мс.
/// 
static const FLASH uint16_t   ADDRESS_EEPROM_TIME_MS                   = 0x0022;

//*****************************************************************************
/// \brief Адрес ячейки EEPROM с текущим временем работы, номер прерывания от системного таймера.
/// 
static const FLASH uint16_t   ADDRESS_EEPROM_TIME_N_TMR                = 0x0024;

//*****************************************************************************
/// \brief Адрес ячейки EEPROM с текущим временем работы, показания системного таймера.
/// 
static const FLASH uint16_t   ADDRESS_EEPROM_TIME_TMR                  = 0x0026;

//*****************************************************************************
/// \brief Адрес ячейки EEPROM с блоком данных от компонента \a Logic.
/// 
static const FLASH uint16_t   ADDRESS_EEPROM_COMPONENT_LOGIC           = 0x0040;

//*****************************************************************************
/// \brief Начальный адрес массивов трассировки. 
/// 
static const FLASH uint16_t   ADDRESS_EEPROM_TRACING                   = 0x0100;

//*****************************************************************************
// Глобальные константы, определенные через макросы
//*****************************************************************************

#define ADDRESS_EEPROM_CALIBRATION_1 0x0030         ///< Калибровочный коэффициент 1.
#define ADDRESS_EEPROM_CALIBRATION_2 0x0FE0         ///< Калибровочный коэффициент 2.
#define ADDRESS_EEPROM_CALIBRATION_3 0x0FE2         ///< Калибровочный коэффициент 3.

#endif

//*****************************************************************************
/**
* История изменений: 
* 
* Версия 1.0.1
* Дата   18-07-2016
* Автор  Третьяков В.Ж.
* 
* Изменения:
*     Базовая версия.
*/
