/**
* \file    Combination4from6_template.h
* \brief   Битовая обработка массива по сочетанию 4 из 6
* \details Шаблон функции
*
* \version 1.0.1
* \date    28-06-2018
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include "../../templates.h"

//*****************************************************************************
// Прототипы интерфейсных функций
//*****************************************************************************

//*****************************************************************************
/// \brief
/// \param arr       - указатель на
/// \param oldResult -
///
TYPE_DATA CAT_NAME_X_Y( Combination4from6, TYPE_DATA )( TYPE_DATA *arr, TYPE_DATA oldResult );

//*****************************************************************************
// Реализация интерфейсных функций
//*****************************************************************************

//*****************************************************************************
//
TYPE_DATA CAT_NAME_X_Y( Combination4from6, TYPE_DATA )( TYPE_DATA *arr, TYPE_DATA oldResult )
{
    TYPE_DATA data, mask1, mask0, result = 0;
    uint8_t i, k;

    for( i = 0; i < N_ARR; )
    {
        data = arr[aIndex4from6[i]]; // обработка сочетаний
        for( k = 1; k < N_COMBINATION; k++ )
        {
            data &= arr[aIndex4from6[i + k]];
        }
        result |= data;
        i += 4;
    }

    data = oldResult ^ result;
    if( data != 0 )
    {
        mask1 = data & result;
        mask0 = ~( data & oldResult );
        for( i = 0; i < N_DATA; i++ )
        {
            arr[i] |= mask1;
            arr[i] &= mask0;
        }
    }

    return result;
}

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   28-06-2018
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая редакция.
*/
