/**
* \file    BinInPinPorts.h
* \brief   Порты ввода-вывода модуля "Чтение дискретных входов, заведенных непосредственно на входы МК"
*
* \version 1.0.1
* \date    11-06-2019
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef BININPINPORTS_H
#define BININPINPORTS_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <xc.h>
#include "IOports.h"

//*****************************************************************************
// Глобальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
/// \brief Состояние входа, определяющего состояние датчика КЗ (0 - подключен).
///
#define P_BIN_IN_PIN_CHECK_SC              PORTGbits.RG14

//*****************************************************************************
/// \brief Состояние входа, определяющего подключение РПВ (0 - подключен).
///
#define P_BIN_IN_PIN_CHECK_RELAY_MAIN_RES  PORTGbits.RG15

//*****************************************************************************
/// \brief Состояние входа, определяющего состояние кнопки "ОТМЕНА": нажата или отжата.
///
#define P_BIN_IN_PIN_CHECK_BUTTON_CANCEL   PORTGbits.RG2

//*****************************************************************************
/// \brief Состояние входа, определяющего состояние кнопки "ВЫБОР": нажата или отжата.
///
#define P_BIN_IN_PIN_CHECK_BUTTON_ENTER    PORTCbits.RC3

//*****************************************************************************
/// \brief Состояние входа, определяющего состояние кнопки "ВВЕРХ": нажата или отжата.
///
#define P_BIN_IN_PIN_CHECK_BUTTON_MORE     PORTFbits.RF4

//*****************************************************************************
/// \brief Состояние входа, определяющего состояние кнопки "ВНИЗ": нажата или отжата.
///
#define P_BIN_IN_PIN_CHECK_BUTTON_LESS     PORTGbits.RG3        

//*****************************************************************************
// Макросы типа функция
//*****************************************************************************

//*****************************************************************************
/// \brief Инициализация портов ввода-вывода дискретных входов, заведенных непосредственно на входы МК.
///
#define P_BIN_IN_PIN_INIC                                                          \
do                                                                                 \
{                                                                                  \
    INIC_PORT_IN(G, 14, eIO_fullOff);        /* Состояние датчика КЗ.       */     \
    INIC_PORT_IN(G, 15, eIO_fullOff);        /* Состояние РПВ.              */     \
    INIC_PORT_IN(G,  2, eIO_fullOff);        /* Кнопка "ОТМЕНА".            */     \
    INIC_PORT_IN(C,  3, eIO_fullOff);        /* Кнопка "ВЫБОР".             */     \
    INIC_PORT_IN(F,  4, eIO_fullOff);        /* Кнопка "ВВЕРХ".             */     \
    INIC_PORT_IN(G,  3, eIO_fullOff);        /* Кнопка "ВНИЗ".              */     \
} while(0)

#endif

//*****************************************************************************
/**
* История изменений:
* 
* Версия 1.0.1
* Дата   11-06-2019
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*/
