/**
* \file    ECAN1_PinRemap.h
* \brief   Настройка пинов на работу с ECAN1
*
* \version 1.0.1
* \date    17-03-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef ECAN1_PinRemap_h
#define ECAN1_PinRemap_h

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <xc.h>

//*****************************************************************************
// Макросы типа функция
//*****************************************************************************

//*****************************************************************************
/// \brief Настройка пинов на работу с ECAN1.
///
#define ECAN1_PIN_REMAP                                                                 \
do                                                                                      \
{                                                                                       \
    INIC_PORT_OUT(B, 6, OPEN_DRAIN_ON);     /* CAN1 Tx pin directions контакт 70 */     \
     _TRISB5 = 1;                           /* CAN1 Rx pin directions контакт 68 */     \
     RPOR2bits.RP38R = _RPOUT_C1TX;         /* CAN1 Tx pin remap.                */     \
     RPINR26bits.C1RXR = 0b1001000;         /* CAN1 Rx pin remap.                */     \
} while( 0 )                                                                          

#endif

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   17-03-2017
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*/
