/**
* \file    ECAN2_PinRemap.h
* \brief   Настройка пинов на работу с ECAN2
*
* \version 1.0.1
* \date    17-03-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef ECAN2_PinRemap_h
#define ECAN2_PinRemap_h

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <xc.h>
#include "IOports.h"

//*****************************************************************************
// Макросы типа функция
//*****************************************************************************

//*****************************************************************************
/// \brief Настройка пинов на работу с ECAN2.
///
#define ECAN2_PIN_REMAP do {\
    INIC_PORT_OUT(B, 7, OPEN_DRAIN_ON); /* CAN1 Tx pin directions контакт 72 */\
    _TRISB5 = 1;                       /* CAN1 Rx pin directions контакт 69 */    \
    RPOR2bits.RP39R = _RPOUT_C2TX;      /* CAN1 Tx pin remap. */        \
    RPINR26bits.C2RXR = 0b0100101;      /* CAN1 Rx pin remap. */        \
} while (0)


#endif

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   17-03-2017
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*/
