/**
* \file    Ecan_DMA.h
* \brief   Макросы для работы с прямым доступом в память устройств ECAN
*
* \version 1.0.1
* \date    16-03-2017
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef DMA_ECAN_h
#define DMA_ECAN_h

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <xc.h>

//*****************************************************************************
// Макросы типа функция
//*****************************************************************************

//*****************************************************************************
/// \brief Конфигурация DMA для ECAN.
/// \param dma - имя DMA, например DMA1;
/// \param direct - направление потока DMA;
/// \param irqSel - код периферийного устройства;
/// \param reg - имя регистра периферийного устройства, например C1TXD;
/// \param arrayRAM - имя буфера ОЗУ или ПЗУ;
/// \param localAddress - имя локальной переменной для конфигурации адреса, тип uint32_t.
///
#define ECAN_CONFIG_DMA(dma, direct, irqSel, reg, arrayRAM, localAddress) do {                                       \
     dma##CONbits.SIZE  = 0x0;                             /* Поток в словах (16 бит) */                             \
     dma##CONbits.DIR   = direct;                          /* Направление потока      */                             \
     dma##CONbits.AMODE = 0x2;                             /* Косвенная адресация (адрес) переферийного устройства */\
     dma##CONbits.MODE  = 0x0;                             /* Постоянная трансляция в/из буфера  */                \
     dma##REQ = irqSel;                                    /* Код периферийного устройства */                        \
     dma##CNT = 7;                                         /* Количество передаваемых данных равно 8 (7+1) */        \
     dma##PAD = (volatile unsigned int)&reg;               /* Адрес периферийного регистра */                        \
     localAddress  = __builtin_edsoffset(arrayRAM);        /* Адрес буфера */                                        \
     localAddress  = localAddress & 0x7FFF;                                                                          \
     localAddress += __builtin_edspage(arrayRAM) <<15;                                                               \
     dma##STAL = localAddress & 0xFFFF;                                                                              \
     dma##STAH = localAddress >>16;                                                                                  \
     dma##CONbits.CHEN = 0x1;                              /* Разрешается работа канала DMA */                       \
} while(0)

//*****************************************************************************
// Объявление типов данных
//*****************************************************************************

//*****************************************************************************
/// \brief Направление потока DMA.
///
typedef enum {
    eDMA_writeRAM = 0,        ///< запись в ОЗУ из устройства
    eDMA_readRAM  = 1         ///< чтение из ОЗУ в устройство
} DMA_direct;

//*****************************************************************************
/// \brief Коды периферийных устройств.
///
typedef enum {
    eDMA_ECAN1_RX = 0x22,        ///< ECAN1, RX
    eDMA_ECAN1_TX = 0x46,        ///< ECAN1, TX
    eDMA_ECAN2_RX = 0x37,        ///< ECAN2, RX
    eDMA_ECAN2_TX = 0x47,        ///< ECAN2, TX
} DMA_irqSel;

#endif

//*****************************************************************************
/**
* История изменений: 
*
* Версия 1.0.1
* Дата   16-03-2017
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*/
