/**
* \file    MainRegisters.h
* \brief   Основные порты и регистры для семейства МК dsPIC33
*
* \version 1.0.1
* \date    14-03-2018
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef MAINREGISTERS_H
#define MAINREGISTERS_H

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <xc.h>

//*****************************************************************************
// Глобальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
/// \brief Разрешение работы сторожевого таймера.
///
#define ENABLE_WATCHDOG  RCONbits.SWDTEN = 1;


//*****************************************************************************
/// \brief Код переключения главного генератора в режим с PLL.
///
#define FNOSC_PRIPLL_            3

//*****************************************************************************
/// \brief Выходная частота.
///
#define F_OSC                    117964800UL

//*****************************************************************************
/// \brief Системная частота процессора.
///
#define F_CY                      58982400UL

//*****************************************************************************
/// \brief Время выполнения 1 команды МК в единицах нСек*10.
///
#define T_CY_NANO_10              170U

//*****************************************************************************
/// \brief Период прерывания от таймера в единицах нСек.
///
#define TIME_PERIOD_INTERRUPT_NS  31250U 

//*****************************************************************************
///// \brief Период прерывания таймера в Tcy.
/////
//#define TIME_PERIOD_INTERRUPT    ((TIME_PERIOD_INTERRUPT_NS)/(T_CY_NANO_10))*10

//*****************************************************************************
// Уставка главного таймера
/// \brief Главный таймер прерываний.
///
#define MAIN_TIMER_LOAD_PR5     58983  //1.0000102 ms при Fcy  = 58.9824 мГц (Tcy = 16.954 нс)

//*****************************************************************************
/// \brief Главный таймер прерываний.
///
#define MAIN_TIMER  TMR5

//*****************************************************************************
/// \brief Регистр периода главного таймера прерываний.
///
#define MAIN_TIMER_PRx PR5

//*****************************************************************************
/// \brief Контрольный регистр главного таймера прерываний.
///
#define MAIN_TIMER_TxCON T5CON 

//*****************************************************************************
/// \brief Остановка главного таймера прерываний.
///
#define MAIN_TIMER_STOP  T5CONbits.TON = 0

//*****************************************************************************
/// \brief Сброс флага прерываний главного таймера.
///
#define MAIN_TIMER_INTERRUPT_CLEAR_FLAG  IFS1bits.T5IF = 0

//*****************************************************************************
/// \brief Запрет прерываний  главного таймера.
///
#define MAIN_TIMER_DISABLE_INTERRUPT  (IEC1bits.T5IE = 0)

//*****************************************************************************
/// \brief Разрешение прерываний  главного таймера.
///
#define MAIN_TIMER_ENABLE_INTERRUPT   (IEC1bits.T5IE = 1)

//*****************************************************************************

//*****************************************************************************
/// \brief Сброс флага прерываний U1RX (UART1)
///
#define U1RX_INTERRUPT_CLEAR_FLAG  (IFS0bits.U1RXIF = 0)

//*****************************************************************************
/// \brief Запрет прерываний  U1RX (UART1)
///
#define U1RX_DISABLE_INTERRUPT  (IEC0bits. U1RXIE = 0)

//*****************************************************************************
/// \brief Разрешение прерываний  U1RX (UART1)
///
#define U1RX_ENABLE_INTERRUPT   (IEC0bits. U1RXIE = 1)

//*****************************************************************************

/// \brief Настройка генератора (осциллятора).
/// \note 
/// 1. Определяются следующие частоты:
///     - Fin  = 14.7456  - частота кварца.
///     - Fref = 3.6864 мГц.
///     - Fsys = 235.9296 мГц.
///     - Fosc = 117.9648 мГц.
///     - Fcy  = 58.9824 мГц (Tcy = 16.954 нс).
/// \note 2. Настраивается предделитель PLLPRE   (N1 = 4), постделитель PLLPOST  (N2 = 2) и обратная связь PLLDIV (M = 64).
/// \note 3. Инициируется переключение главного генератора в режим с PLL.
/// \note 4. Ожидание переключения главного генератора в режим XT с PLL.  
///
#define SET_OSCILLATOR do { \
    CLKDIVbits.PLLPRE  = 2; \
    CLKDIVbits.PLLPOST = 0; \
    PLLFBDbits.PLLDIV  = 62; \
     __builtin_write_OSCCONH(FNOSC_PRIPLL_); \
     __builtin_write_OSCCONL(0x01); \
    while (OSCCONbits.COSC != FNOSC_PRIPLL_) {\
    }\
    while (OSCCONbits.LOCK != 1) {\
    }\
} while (0)

//*****************************************************************************
/// \brief Настройка главного таймера прерываний.
///
#define MAIN_TIMER_INIT do {                                         \
    T5CONbits.TON   = 0;          /* Stop any 16-bit Timer operation         */\
    T5CONbits.TCS   = 0;          /* Select internal instruction cycle clock */\
    T5CONbits.TGATE = 0;          /* Disable Gated Timer mode                */\
    T5CONbits.TCKPS = 0b00;       /* Select 1:1 Prescaler                    */\
    TMR5            = 0x00;       /* Clear 16-bit Timer                      */\
    PR5 = MAIN_TIMER_LOAD_PR5;    /* Load 16-bit period value                */\
} while(0)
//*****************************************************************************
/// \brief Запуск главного таймера прерываний.
///
#define MAIN_TIMER_START do {                                                  \
    T5CONbits.TON   = 1;          /* Start 16-bit Timer  */                    \
} while(0)


//*****************************************************************************
/// \brief Настройка прерываний.
///  
#define INTERRUPT_INIT do {                                                                           \
    INTCON1bits.NSTDIS = 0;          /* Разрешение вложенности прерываний */                          \
    IPC7bits.T5IP      = 4;          /* Установка приоритета прерываний по главному таймеру */        \
                                     /* Настройка прерываний главного таймера */                      \
    MAIN_TIMER_INTERRUPT_CLEAR_FLAG; /* Сброс флага таймера прерываний главного таймера */            \
    MAIN_TIMER_ENABLE_INTERRUPT;     /* Разрешение прерываний от главного таймера */                  \
    U1RX_INTERRUPT_CLEAR_FLAG;       /* Сброс флага прерываний U1RX */                                \
    U1RX_ENABLE_INTERRUPT;     /* Разрешение прерываний от U1RX */                              \
} while(0)

//*****************************************************************************
/// \brief Запрет всех прерываний.
///
#define INTERRUPT_ALL_DISABLE do {                                                 \
    MAIN_TIMER_DISABLE_INTERRUPT; /* Запрешение прерываний от главного таймера  */ \
    RCONbits.SWDTEN = 0;                                                           \
} while(0)    

#endif

//*****************************************************************************
/**
* История изменений:
* 
* Версия 1.0.1
* Дата   14-03-2018
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*/
