/**
* \file    UartPinRemap.h
* \brief   Настройка пинов на работу с UART
*
* \version 1.0.1
* \date    19-07-2019
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Команды препроцессора для предотвращения повторного включения содержимого файла
//*****************************************************************************
#ifndef UARTPINREMAP_h
#define UARTPINREMAP_h

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <xc.h>

//*****************************************************************************
// Макросы типа функция
//*****************************************************************************

//*****************************************************************************
/// \brief Настройка пинов на работу с UART1. (Bluetooth))
///
#define UART1_PIN_REMAP                                                                         \
do                                                                                              \
{                                                                                               \
     _TRISC1 = 0;                        /* UART1 Tx pin directions контакт 33 на вывод */      \
     _TRISC2 = 1;                        /* UART1 Rx pin directions контакт 34 на ввод */       \
     RPOR5bits.RP49R   = _RPOUT_U1TX;    /* UART1 Tx pin remap. контакт TxD = к.76 */           \
     RPINR18bits.U1RXR = 0b0110010;      /* UART1 Rx pin remap. контакт RxD = к.77 */           \
} while( 0 )

//*****************************************************************************
/// \brief Настройка пинов на работу с UART2. (ГП3С Rx-master)
///
#define UART2_PIN_REMAP                                                                         \
do                                                                                              \
{                                                                                               \
     _TRISC13 = 1;                       /* UART1 Rx pin directions контакт 57 на ввод */       \
     RPINR19bits.U2RXR = 0b0110101;      /* UART1 Rx pin remap. контакт RxD = к.57 */           \
} while( 0 )

//*****************************************************************************
/// \brief Настройка пинов на работу с UART3. (ГП3С Rx-slave)
///
#define UART3_PIN_REMAP                                                                         \
do                                                                                              \
{                                                                                               \
     _TRISC10 = 1;                       /* UART1 Rx pin directions контакт 55 на ввод */       \
     RPINR27bits.U3RXR = 0b0110011;      /* UART1 Rx pin remap. контакт RxD = к.55 */           \
} while( 0 )

//*****************************************************************************
/// \brief Настройка пинов на работу с UART4. 
///
#define UART4_PIN_REMAP                                              \

#endif

//*****************************************************************************
/**
* История изменений:
*
* Версия 1.0.1
* Дата   19-07-2019
* Автор  Третьяков В.Ж.
*
* Изменения:
*    Базовая версия.
*/
