/**
* \file    Combination4from6.c
* \brief   \copybrief Combination4from6.h
*
* \version 1.0.1
* \date    27-06-2018
* \author  Третьяков В.Ж.
*/

//*****************************************************************************
// Подключаемые файлы
//*****************************************************************************
#include <stdint.h>
#include "Combination4from6.h"

//*****************************************************************************
// Локальные константы, определенные через макросы
//*****************************************************************************

//*****************************************************************************
/// \brief Необходимое количество совпадающих битов.
///
#define N_COMBINATION 4

//*****************************************************************************
/// \brief Количество данных.
///
#define N_DATA        6

//*****************************************************************************
/// \brief Размер массива индексов.
///
#define N_ARR         60

//*****************************************************************************
// Объявление локальных типизированных констант
//*****************************************************************************

//*****************************************************************************
/// \brief Индексы в массиве для сочетаний 4 из 6.
/// \note 1 - признак конца массива.
///
const int8_t aIndex4from6[N_ARR] = 
{
    0, 1, 2, 3,
    0, 1, 2, 4,
    0, 1, 2, 5,
    0, 1, 3, 4,
    0, 1, 3, 5,
    0, 1, 4, 5,
    0, 2, 3, 4,
    0, 2, 3, 5,
    0, 2, 4, 5,
    0, 3, 4, 5,
    1, 2, 3, 4,
    1, 2, 3, 5,
    1, 2, 4, 5,
    1, 3, 4, 5,
    2, 3, 4, 5
};

//*****************************************************************************
// Макроопределения, управляющие компиляцией
//*****************************************************************************

#ifdef TYPE_DATA  
    #undef TYPE_DATA  
#endif

//*****************************************************************************
/// \brief Битовая обработка массива данных по сочетанию 4 из 6. 
///
#define TYPE_DATA uint16_t    // 16-битные данные
#include "Combination4from6_template.h"
#ifdef TYPE_DATA  
    #undef TYPE_DATA  
#endif

//*****************************************************************************
/// \brief Битовая обработка массива данных по сочетанию 4 из 6.
///
#define TYPE_DATA uint8_t    // 8-битные данные
#include "Combination4from6_template.h"
#ifdef TYPE_DATA  
    #undef TYPE_DATA  
#endif

//*****************************************************************************
/**
* История изменений:
* 
* Версия 1.0.1
* Дата   27-06-2018
* Автор  Третьяков В.Ж.
* 
* Изменения:
*    Базовая версия.
*/
